s2nmt/Smart_Parking/2. Firmware/STM32F103C8T6__RFID/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RST_BW16_Pin GPIO_PIN_1
#define RST_BW16_GPIO_Port GPIOA
#define RFID_SS_Pin GPIO_PIN_4
#define RFID_SS_GPIO_Port GPIOA
#define RFID_Reset_Pin GPIO_PIN_0
#define RFID_Reset_GPIO_Port GPIOB
#define RFID_IRQ_Pin GPIO_PIN_1
#define RFID_IRQ_GPIO_Port GPIOB
#define Buzzer_Pin GPIO_PIN_2
#define Buzzer_GPIO_Port GPIOB
#define GreenLed_Pin GPIO_PIN_10
#define GreenLed_GPIO_Port GPIOB
#define RedLed_Pin GPIO_PIN_11
#define RedLed_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
#define DeviceID "D0001"
#define Version "Ver 1.0"

#define WIRELESS_MAX_BYTES 500
//...WiFi light status
#define CHECK_CONNECTING_WIFIAP 4
#define SMARTCONFIG_WIFI 2
#define SUCCESSFULLY_CONNECTED_WIFIAP 0
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
